<template>
	<div class="updatelog-box">
		<h2>版本 4.5<span>(2025-06-07)</span></h2>
		<ul>
			<li>新增全选任务按钮、应用参数到全部任务按钮</li>
			<li>新增“FFBox 推荐画质设定”文档及本地知识库窗口，并修正了几款编码器画质滑块的标定值</li>
			<li>新增 3 种模式的保留元数据参数、4 种模式的保留文件时间功能</li>
			<li>新增限制一倍速参数</li>
			<li>新增“复制任务”功能、“查看图表”任务菜单项</li>
			<li>新增功能限制的进度条展示和表格说明</li>
			<li>更新软件字体</li>
			<li>支持在气泡提示/吐司组件中使用换行，并依此优化了部分参数描述的文案与显示效果</li>
			<li>吐司组件支持手动关闭，吐司组件和标签页组件支持鼠标中键关闭</li>
			<li>菜单支持根据文字自动缩放宽度</li>
			<li>增加任务列表和同时运行任务数量限制</li>
			<li>修复无色按钮按下时的效果（含 Windows 安装程序）</li>
		</ul>
		<h2>版本 4.4<span>(2025-05-01)</span></h2>
		<ul>
			<li>新增 FFmpeg 编码器信息自动获取功能，自动生成其支持的所有编码器的选项并允许开关</li>
			<li>后端新增全局错误捕获，有效避免无故崩溃</li>
			<li>后端新增意外退出后自动恢复未完成任务功能</li>
			<li>优化 FFmpeg 状态机，更好识别任务停止状态</li>
			<li>新增 webUI，可在后端启动时启动</li>
			<li>新增简易用户系统</li>
			<li>修复 Windows 安装程序在非整数倍缩放和多屏下界面异常问题</li>
		</ul>
		<h2>版本 4.3<span>(2025-01-01)</span></h2>
		<ul>
			<li>重构任务管理机制。现支持对单个任务进行状态控制和展示，支持排队中状态，支持设置同时运行任务数</li>
			<li>后端新增 help、port、loglevel 等指令或启动参数功能</li>
			<li>优化后端 log 信息的展示效果</li>
			<li>新增 ffmpeg 路径手动配置功能</li>
			<li>激活信息支持自动保存，无需每次启动软件手动进行激活</li>
		</ul>
		<h2>版本 4.2<span>(2024-09-01)</span></h2>
		<ul>
			<li>新增仪表板的折线图功能，支持进度、数据量、码率分布、速度分布、传输进度、传输速度分布 6 大图表显示</li>
			<li>新增添加任务弹窗，支持放入文件夹以递归添加文件，以及支持拖入和手动输入字符串按 URL 添加任务</li>
			<li>使用 Inno Setup 全新实现 Windows 平台上的安装程序</li>
			<li>主菜单进行部分操作时自动收起菜单中心</li>
			<li>修复重启任务和完成任务前一刻进度数据混乱</li>
			<li>修复设定帧速下的预计剩余时间错误</li>
			<li>打赏中心更新爱发电链接并新增自动中转链接</li>
		</ul>
		<h2>版本 4.1<span>(2024-06-23)</span></h2>
		<ul>
			<li>新增数据量进制和词头切换功能</li>
			<li>修改 preset 等 slider 类型数据格式为字符串，避免滑块在两个值之间</li>
			<li>修正部分视频参数</li>
			<li>修复 Windows 上转码完成后无法双击打开文件</li>
			<li>任务项的组件形式改为 tsx setup 函数，优化性能表现</li>
			<li>任务项的任务名和参数一览支持悬浮显示详细信息，并优化两者占用的显示宽度</li>
			<li>任务项的剩余时间数位更改，秒和帧取消横条值显示</li>
			<li>任务项的输出命令行支持自动滚到底</li>
			<li>打赏中心新增爱发电链接</li>
			<li>更新激活机制</li>
		</ul>
		<h2>版本 4.0<span>(2024-04-01)</span></h2>
		<ul>
			<li>全新 UI，简洁明快</li>
			<li>整体页面结构调整。改用更现代、更符合逻辑的标签栏、操作栏、任务列表、参数面板、状态栏垂直分布结构</li>
			<li>布局紧凑度调整。提升有效信息的显示面积和密度</li>
			<li>新增深色颜色主题</li>
			<li>更考究地设计了按钮质感及背景色的层次关系，代码层面上统一为 10 级层次、上高光、浅背景、阴影、反转色等</li>
			<li>重新设计任务信息条。具有更直观且位置稳定的输入输出参数对比栏，进度信息增加实时输出大小和预计剩余时间显示，输入输出命令行改为直接在任务上显示</li>
			<li>消息弹窗使用全新云母材质界面</li>
			<li>各种提示信息加入更友好的表情图</li>
			<li>重新设计菜单组件。支持命令式和选项式菜单；支持多层菜单，将分辨率、帧速进行分组显示</li>
			<li>支持隔行扫描相关参数</li>
			<li>支持输入自定义参数</li>
			<li>“快捷面板”功能正式加入：支持将当前配置保存为预设</li>
			<li>新增大按钮菜单栏，融合 Windows 与 macOS 使用习惯，支持 Windows Snap Layout、快捷键操作等功能</li>
			<li>新增基于 C++ 的开屏页及启动进度显示，首屏加载耗时压缩至 0.3s</li>
			<li>全面投入 Vue3 怀抱，主要使用 script setup lang="ts"，附以 tsx 实现部分组件</li>
			<li>改用 Vite 作为主力 bundler，纯手工编写配置与开发打包脚本，拒绝轮子套轮子</li>
			<li>状态管理改用更符合 Vue3 响应式思想的 pinia</li>
			<li>使用 less 作为 CSS 预编译器</li>
			<li>颜色转换函数改用 hwb</li>
			<li>electron 渲染进程关闭 nodeIntegration，改用 preload 实现 jsb 中转层，提高规范性</li>
			<li>FFBoxHelper 新增使用了 DirectX 和命名管道等技术</li>
			<li>任务列表信息、任务信息、通知信息改为请求式，避免不必要的广播；任务消息脱离任务本体，删除任务不删除通知</li>
			<li>改用 localStorage 进行存储，并附以嵌套属性解析器</li>
			<li>支持通过开发打包脚本，将当前的 git 版本信息打入代码中</li>
			<li>前后端实现全分离。后端支持独立运行，前端开发层面上支持使用浏览器运行</li>
			<li>新增使用许可和条款，提高了用户的平均素质</li>
		</ul>
		<h2>版本 3.0<span>(2022-06-23)</span></h2>
		<ul>
			<li>软件架构分离为转码调度逻辑层（后台）和前端展示层（前台），前后台运行互不干扰，增强健壮性！</li>
			<li>支持远程转码，您终于可以用 FFBox 私有化部署转码平台了！</li>
			<li>添加了一个丝滑的启动动画！</li>
			<li>Windows 端添加了毛玻璃特效！</li>
			<li>优化了气泡组件的动画效果，添加了消失倒计时！</li>
			<li>优化了组合下拉框的操作逻辑和动画！</li>
			<li>优化了任务项的文件名显示、时间（进度）显示！</li>
			<li>转码完成后的文件可以双击打开了！</li>
			<li>ffmpeg 的异常终止现可以被正确识别了！</li>
			<li>把 VB 编写的 PauseAndResumeProcess 改成了 C++ 编写的 FFBoxHelper！</li>
			<li>编程语言加入了 TypeScript！</li>
			<li>修复了设置音频采样率导致出错的问题</li>
			<li>修复了输出纯音频文件不能显示进度的问题</li>
			<li>修复了不识别 MKV 容器的问题</li>
			<li>打赏中心增加了 Gitee 和 Ko-fi 链接</li>
			<li>增加了激活机制（打赏中心按钮那能去掉这玩意，您研究下……）</li>
		</ul>
		<h2>版本 2.6<span>(2021-01-05)</span></h2>
		<ul>
			<li>增加了 macOS 系统的相关支持</li>
			<li>优化了“输出文件名”参数的相关功能</li>
		</ul>
		<h2>版本 2.5<span>(2020-09-26)</span></h2>
		<ul>
			<li>新增恢复默认参数功能</li>
			<li>打赏中心更名“支持作者”面板，并新增支付宝红包二维码和 github 链接</li>
			<li>修复升级或第一次启动后无法初始化参数的 bug</li>
			<li>新增时间剪辑参数、输出文件名参数</li>
		</ul>
		<h2>版本 2.4<span>(2020-09-21)</span></h2>
		<ul>
			<li>优化了添加文件的逻辑以加快速度</li>
			<li>重新进行了参数分类</li>
		</ul>
		<h2>版本 2.3<span>(2020-08-24)</span></h2>
		<ul>
			<li>调整了资源文件的布局</li>
			<li>实现了 Linux 平台上的任务暂停功能</li>
			<li>优化了 combomenu、slider、checkbox 等的键盘操作逻辑</li>
			<li>新增了打赏中心</li>
		</ul>
		<h2>版本 2.2<span>(2020-08-19)</span></h2>
		<ul>
			<li>优化了错误识别，修改了一些参数项</li>
			<li>combobox 新增手动输入功能，combomenu 新增键盘操控支持</li>
		</ul>
		<h2>版本 2.1<span>(2020-08-06)</span></h2>
		<ul>
			<li>修复了任务结束后不能开始下一个任务的 bug</li>
			<li>修复了任务栏进度、外部关闭信号、消息弹窗的 bug</li>
			<li>分离了视频和音频的码率控制参数</li>
		</ul>
		<h2>版本 2.0<span>(2020-07-30)</span></h2>
		<ul>
			<li>使用 vue-cli 重构本项目，代码量增加了，运行开销增大了，但是结构好多了，方便其他人参与项目了（虽然并不会有</li>
			<li>“为以后版本铺垫的东西”其中一部分指皮肤更换功能。现在重构了，这功能就难做多了，所以白铺垫了</li>
			<li>优化了可访问性，读屏器可以更好地读出 FFBox 的窗口内容了</li>
			<li>增大了窗口三大金刚按钮和任务暂停删除重置按钮的识别范围</li>
			<li>微调了外观颜色</li>
			<li>统一了 Tooltip 样式</li>
			<li>combo 菜单外观优化</li>
			<li>新增窗口元素全局拖拽捕获，拖动元素时鼠标在容器外也可捕获</li>
			<li>增加了视频和音频编码选项“自动”和“禁用”，可以选择单独禁用视频或音频了</li>
			<li>“硬件编码”入口改为“编码器”，支持选择更多编码器</li>
			<li>大幅精简了分辨率列表</li>
			<li>补充了少量编码器的详细参数</li>
			<li>任务列表排版不再有 js 参与，性能会稍微好一丢丢</li>
			<li>当然因为 vue 的原因，性能又会变差一点</li>
			<li>暂时移除了“快捷”中的参数预览功能</li>
			<li>“指令”中的 FFmpeg 输出现在可以显示单个任务或全局的命令行输出了</li>
			<li>“指令”中的 FFmpeg 输出在隐藏时停止刷新，减少布局重流导致的 CPU 占用</li>
			<li>新增了程序新版本检查功能</li>
		</ul>
		<h2>版本 1.1<span>(2020-05-12)</span></h2>
		<ul>
			<li>对 FFmpeg 状态的识别更加准确了，消除了令人烦恼的设计缺陷</li>
			<li>增加了弹窗和气泡的动效，改善了选中任务的动效</li>
			<li>增加强制结束 FFmpeg 功能</li>
			<li>增加硬件解码模式“自动”</li>
			<li>做了一些为以后版本铺垫的东西【反正你们看不懂 (｀・ω・´)</li>
		</ul>
		<h2>版本 1.0<span>(2019-11-11)</span></h2>
	</div>

</template>

<style scoped lang="less">
	/* 固定布局项——更新历史 */
	.updatelog-box {
		padding: 0 5%;
		font-size: 14px;
		// overflow: auto;
		// font-family: "苹方 中等", "PingFang SC", 苹方, 微软雅黑, "Segoe UI", Consolas, Avenir, Arial, Helvetica, sans-serif, 黑体;
		font-weight: 500;
		text-align: left;
		ul {
			padding-inline-start: 1.5em;
			line-height: 1.5em;
		}
		li {
			margin-bottom: 4px;
		}
		span {
			font-size: 0.5em;
			opacity: 0.5;
			margin-left: 1em;
		}
	}
</style>